institute-mpsu-miet/uos_embedded/runtime/mips/io-pic32mx.h
/*
 * Hardware register defines for Microchip PIC32MX microcontrollers.
 *
 * Copyright (C) 2010-2012 Serge Vakulenko, <serge@vak.ru>
 *
 * Permission to use, copy, modify, and distribute this software
 * and its documentation for any purpose and without fee is hereby
 * granted, provided that the above copyright notice appear in all
 * copies and that both that the copyright notice and this
 * permission notice and warranty disclaimer appear in supporting
 * documentation, and that the name of the author not be used in
 * advertising or publicity pertaining to distribution of the
 * software without specific, written prior permission.
 *
 * The author disclaim all warranties with regard to this
 * software, including all implied warranties of merchantability
 * and fitness.  In no event shall the author be liable for any
 * special, indirect or consequential damages or any damages
 * whatsoever resulting from loss of use, data or profits, whether
 * in an action of contract, negligence or other tortious action,
 * arising out of or in connection with the use or performance of
 * this software.
 */
#ifndef _IO_PIC32MX_H
#define _IO_PIC32MX_H

/*--------------------------------------
 * Coprocessor 0 registers.
 */
#define C0_HWRENA	7	/* Enable RDHWR in non-privileged mode */
#define C0_BADVADDR	8	/* Virtual address of last exception */
#define C0_COUNT	9	/* Processor cycle count */
#define C0_COMPARE	11	/* Timer interrupt control */
#define C0_STATUS	12	/* Processor status and control */
#define C0_INTCTL	12	/* Select 1: interrupt control */
#define C0_SRSCTL	12	/* Select 2: GPR shadow set control */
#define C0_SRSMAP	12	/* Select 3: vector to shadow set mapping */
#define C0_CAUSE	13	/* Cause of last exception */
#define C0_EPC		14	/* Program counter at last exception */
#define C0_PRID		15	/* Processor identification (read only) */
#define C0_EBASE	15	/* Select 1: exception base address */
#define C0_CONFIG	16	/* Configuration */
#define C0_CONFIG1	16	/* Select 1: configuration 1 */
#define C0_CONFIG2	16	/* Select 2: configuration 2 */
#define C0_CONFIG3	16	/* Select 3: configuration 3 */
#define C0_DEBUG	23	/* Debug control and status */
#define C0_DEPC		24	/* Program counter at last debug exception */
#define C0_ERROREPC	30	/* Program counter at last error */
#define C0_DESAVE	31	/* Debug handler scratchpad register */

/*
 * Status register.
 */
#define ST_CU0		0x10000000	/* Access to coprocessor 0 allowed (in user mode) */
#define ST_RP		0x08000000	/* Enable reduced power mode */
#define ST_RE		0x02000000	/* Reverse endianness (in user mode) */
#define ST_BEV		0x00400000	/* Exception vectors: bootstrap */
#define ST_SR		0x00100000	/* Soft reset */
#define ST_NMI		0x00080000	/* NMI reset */
#define ST_IPL(x)	((x) << 10)	/* Current interrupt priority level */
#define ST_UM		0x00000010	/* User mode */
#define ST_ERL		0x00000004	/* Error level */
#define ST_EXL		0x00000002	/* Exception level */
#define ST_IE		0x00000001	/* Interrupt enable */

/*
 * Сause register.
 */
#define CA_BD		0x80000000	/* Exception occured in delay slot */
#define CA_TI		0x40000000	/* Timer interrupt is pending */
#define CA_CE		0x30000000	/* Coprocessor exception */
#define CA_DC		0x08000000	/* Disable COUNT register */
#define CA_IV		0x00800000	/* Use special interrupt vector 0x200 */
#define CA_RIPL(r)	((r)>>10 & 63)	/* Requested interrupt priority level */
#define CA_IP1		0x00020000	/* Request software interrupt 1 */
#define CA_IP0		0x00010000	/* Request software interrupt 0 */
#define CA_EXC_CODE	0x0000007c	/* Exception code */

#define CA_Int		0		/* Interrupt */
#define CA_AdEL		(4 << 2)	/* Address error, load or instruction fetch */
#define CA_AdES		(5 << 2)	/* Address error, store */
#define CA_IBE		(6 << 2)	/* Bus error, instruction fetch */
#define CA_DBE		(7 << 2)	/* Bus error, load or store */
#define CA_Sys		(8 << 2)	/* Syscall */
#define CA_Bp		(9 << 2)	/* Breakpoint */
#define CA_RI		(10 << 2)	/* Reserved instruction */
#define CA_CPU		(11 << 2)	/* Coprocessor unusable */
#define CA_Ov		(12 << 2)	/* Arithmetic overflow */
#define CA_Tr		(13 << 2)	/* Trap */

#define DB_DBD          (1 << 31)       /* Debug exception in a branch delay slot */
#define DB_DM           (1 << 30)       /* Debug mode */
#define DB_NODCR        (1 << 29)       /* No dseg present */
#define DB_LSNM         (1 << 28)       /* Load/stores in dseg go to main memory */
#define DB_DOZE         (1 << 27)       /* Processor was in low-power mode */
#define DB_HALT         (1 << 26)       /* Internal system bus clock was running */
#define DB_COUNTDM      (1 << 25)       /* Count register is running in Debug mode */
#define DB_IBUSEP       (1 << 24)       /* Instruction fetch bus error exception */
#define DB_DBUSEP       (1 << 21)       /* Data access bus error exception */
#define DB_IEXI         (1 << 20)       /* Imprecise error exception */
#define DB_VER          (7 << 15)       /* EJTAG version number */
#define DB_DEXCCODE     (0x1f << 10)    /* Cause of exception in Debug mode */
#define DB_SST          (1 << 8)        /* Single step exception enabled */
#define DB_DIBImpr      (1 << 6)        /* Imprecise debug instruction break */
#define DB_DINT         (1 << 5)        /* Debug interrupt exception */
#define DB_DIB          (1 << 4)        /* Debug instruction break exception */
#define DB_DDBS         (1 << 3)        /* Debug data break exception on store */
#define DB_DDBL         (1 << 2)        /* Debug data break exception on load */
#define DB_DBP          (1 << 1)        /* Debug software breakpoint exception */
#define DB_DSS          (1 << 0)        /* Debug single-step exception */

/*--------------------------------------
 * Peripheral registers.
 */
#define PIC32_R(a)		*(volatile unsigned*)(0xBF800000 + (a))

/*--------------------------------------
 * UART registers.
 */
#define U1MODE		PIC32_R (0x6000) /* Mode */
#define U1MODECLR	PIC32_R (0x6004)
#define U1MODESET	PIC32_R (0x6008)
#define U1MODEINV	PIC32_R (0x600C)
#define U1STA		PIC32_R (0x6010) /* Status and control */
#define U1STACLR	PIC32_R (0x6014)
#define U1STASET	PIC32_R (0x6018)
#define U1STAINV	PIC32_R (0x601C)
#define U1TXREG		PIC32_R (0x6020) /* Transmit */
#define U1RXREG		PIC32_R (0x6030) /* Receive */
#define U1BRG		PIC32_R (0x6040) /* Baud rate */
#define U1BRGCLR	PIC32_R (0x6044)
#define U1BRGSET	PIC32_R (0x6048)
#define U1BRGINV	PIC32_R (0x604C)

#if defined(PIC32MX1) || defined(PIC32MX2) || \
    defined(PIC32MX3) || defined(PIC32MX4)
#define U2MODE		PIC32_R (0x6200) /* Mode */
#define U2MODECLR	PIC32_R (0x6204)
#define U2MODESET	PIC32_R (0x6208)
#define U2MODEINV	PIC32_R (0x620C)
#define U2STA		PIC32_R (0x6210) /* Status and control */
#define U2STACLR	PIC32_R (0x6214)
#define U2STASET	PIC32_R (0x6218)
#define U2STAINV	PIC32_R (0x621C)
#define U2TXREG		PIC32_R (0x6220) /* Transmit */
#define U2RXREG		PIC32_R (0x6230) /* Receive */
#define U2BRG		PIC32_R (0x6240) /* Baud rate */
#define U2BRGCLR	PIC32_R (0x6244)
#define U2BRGSET	PIC32_R (0x6248)
#define U2BRGINV	PIC32_R (0x624C)
#endif
#ifdef PIC32MX7
#define U4MODE		PIC32_R (0x6200) /* Mode */
#define U4MODECLR	PIC32_R (0x6204)
#define U4MODESET	PIC32_R (0x6208)
#define U4MODEINV	PIC32_R (0x620C)
#define U4STA		PIC32_R (0x6210) /* Status and control */
#define U4STACLR	PIC32_R (0x6214)
#define U4STASET	PIC32_R (0x6218)
#define U4STAINV	PIC32_R (0x621C)
#define U4TXREG		PIC32_R (0x6220) /* Transmit */
#define U4RXREG		PIC32_R (0x6230) /* Receive */
#define U4BRG		PIC32_R (0x6240) /* Baud rate */
#define U4BRGCLR	PIC32_R (0x6244)
#define U4BRGSET	PIC32_R (0x6248)
#define U4BRGINV	PIC32_R (0x624C)

#define U3MODE		PIC32_R (0x6400) /* Mode */
#define U3MODECLR	PIC32_R (0x6404)
#define U3MODESET	PIC32_R (0x6408)
#define U3MODEINV	PIC32_R (0x640C)
#define U3STA		PIC32_R (0x6410) /* Status and control */
#define U3STACLR	PIC32_R (0x6414)
#define U3STASET	PIC32_R (0x6418)
#define U3STAINV	PIC32_R (0x641C)
#define U3TXREG		PIC32_R (0x6420) /* Transmit */
#define U3RXREG		PIC32_R (0x6430) /* Receive */
#define U3BRG		PIC32_R (0x6440) /* Baud rate */
#define U3BRGCLR	PIC32_R (0x6444)
#define U3BRGSET	PIC32_R (0x6448)
#define U3BRGINV	PIC32_R (0x644C)

#define U6MODE		PIC32_R (0x6600) /* Mode */
#define U6MODECLR	PIC32_R (0x6604)
#define U6MODESET	PIC32_R (0x6608)
#define U6MODEINV	PIC32_R (0x660C)
#define U6STA		PIC32_R (0x6610) /* Status and control */
#define U6STACLR	PIC32_R (0x6614)
#define U6STASET	PIC32_R (0x6618)
#define U6STAINV	PIC32_R (0x661C)
#define U6TXREG		PIC32_R (0x6620) /* Transmit */
#define U6RXREG		PIC32_R (0x6630) /* Receive */
#define U6BRG		PIC32_R (0x6640) /* Baud rate */
#define U6BRGCLR	PIC32_R (0x6644)
#define U6BRGSET	PIC32_R (0x6648)
#define U6BRGINV	PIC32_R (0x664C)

#define U2MODE		PIC32_R (0x6800) /* Mode */
#define U2MODECLR	PIC32_R (0x6804)
#define U2MODESET	PIC32_R (0x6808)
#define U2MODEINV	PIC32_R (0x680C)
#define U2STA		PIC32_R (0x6810) /* Status and control */
#define U2STACLR	PIC32_R (0x6814)
#define U2STASET	PIC32_R (0x6818)
#define U2STAINV	PIC32_R (0x681C)
#define U2TXREG		PIC32_R (0x6820) /* Transmit */
#define U2RXREG		PIC32_R (0x6830) /* Receive */
#define U2BRG		PIC32_R (0x6840) /* Baud rate */
#define U2BRGCLR	PIC32_R (0x6844)
#define U2BRGSET	PIC32_R (0x6848)
#define U2BRGINV	PIC32_R (0x684C)

#define U5MODE		PIC32_R (0x6A00) /* Mode */
#define U5MODECLR	PIC32_R (0x6A04)
#define U5MODESET	PIC32_R (0x6A08)
#define U5MODEINV	PIC32_R (0x6A0C)
#define U5STA		PIC32_R (0x6A10) /* Status and control */
#define U5STACLR	PIC32_R (0x6A14)
#define U5STASET	PIC32_R (0x6A18)
#define U5STAINV	PIC32_R (0x6A1C)
#define U5TXREG		PIC32_R (0x6A20) /* Transmit */
#define U5RXREG		PIC32_R (0x6A30) /* Receive */
#define U5BRG		PIC32_R (0x6A40) /* Baud rate */
#define U5BRGCLR	PIC32_R (0x6A44)
#define U5BRGSET	PIC32_R (0x6A48)
#define U5BRGINV	PIC32_R (0x6A4C)
#endif

