institute-mpsu-miet/uos_embedded/runtime/mips/io-pic32mx.h
#define TRISG		PIC32_R (0x86180) /* Port G: mask of inputs */
#define TRISGCLR	PIC32_R (0x86184)
#define TRISGSET	PIC32_R (0x86188)
#define TRISGINV	PIC32_R (0x8618C)
#define PORTG		PIC32_R (0x86190) /* Port G: read inputs, write outputs */
#define PORTGCLR	PIC32_R (0x86194)
#define PORTGSET	PIC32_R (0x86198)
#define PORTGINV	PIC32_R (0x8619C)
#define LATG		PIC32_R (0x861A0) /* Port G: read/write outputs */
#define LATGCLR		PIC32_R (0x861A4)
#define LATGSET		PIC32_R (0x861A8)
#define LATGINV		PIC32_R (0x861AC)
#define ODCG		PIC32_R (0x861B0) /* Port G: open drain configuration */
#define ODCGCLR		PIC32_R (0x861B4)
#define ODCGSET		PIC32_R (0x861B8)
#define ODCGINV		PIC32_R (0x861BC)

#define CNCON		PIC32_R (0x861C0) /* Interrupt-on-change control */
#define CNCONCLR	PIC32_R (0x861C4)
#define CNCONSET	PIC32_R (0x861C8)
#define CNCONINV	PIC32_R (0x861CC)
#define CNEN		PIC32_R (0x861D0) /* Input change interrupt enable */
#define CNENCLR		PIC32_R (0x861D4)
#define CNENSET		PIC32_R (0x861D8)
#define CNENINV		PIC32_R (0x861DC)
#define CNPUE		PIC32_R (0x861E0) /* Input pin pull-up enable */
#define CNPUECLR	PIC32_R (0x861E4)
#define CNPUESET	PIC32_R (0x861E8)
#define CNPUEINV	PIC32_R (0x861EC)
#endif

#if defined(PIC32MX1) || defined(PIC32MX2)
#define ANSELA		PIC32_R (0x86000) /* Port A: analog select */
#define ANSELACLR	PIC32_R (0x86004)
#define ANSELASET	PIC32_R (0x86008)
#define ANSELAINV	PIC32_R (0x8600C)
#define TRISA		PIC32_R (0x86010) /* Port A: mask of inputs */
#define TRISACLR	PIC32_R (0x86014)
#define TRISASET	PIC32_R (0x86018)
#define TRISAINV	PIC32_R (0x8601C)
#define PORTA		PIC32_R (0x86020) /* Port A: read inputs, write outputs */
#define PORTACLR	PIC32_R (0x86024)
#define PORTASET	PIC32_R (0x86028)
#define PORTAINV	PIC32_R (0x8602C)
#define LATA		PIC32_R (0x86030) /* Port A: read/write outputs */
#define LATACLR		PIC32_R (0x86034)
#define LATASET		PIC32_R (0x86038)
#define LATAINV		PIC32_R (0x8603C)
#define ODCA		PIC32_R (0x86040) /* Port A: open drain configuration */
#define ODCACLR		PIC32_R (0x86044)
#define ODCASET		PIC32_R (0x86048)
#define ODCAINV		PIC32_R (0x8604C)

#define ANSELB		PIC32_R (0x86100) /* Port B: analog select */
#define ANSELBCLR	PIC32_R (0x86104)
#define ANSELBSET	PIC32_R (0x86108)
#define ANSELBINV	PIC32_R (0x8610C)
#define TRISB		PIC32_R (0x86110) /* Port B: mask of inputs */
#define TRISBCLR	PIC32_R (0x86114)
#define TRISBSET	PIC32_R (0x86118)
#define TRISBINV	PIC32_R (0x8611C)
#define PORTB		PIC32_R (0x86120) /* Port B: read inputs, write outputs */
#define PORTBCLR	PIC32_R (0x86124)
#define PORTBSET	PIC32_R (0x86128)
#define PORTBINV	PIC32_R (0x8612C)
#define LATB		PIC32_R (0x86130) /* Port B: read/write outputs */
#define LATBCLR		PIC32_R (0x86134)
#define LATBSET		PIC32_R (0x86138)
#define LATBINV		PIC32_R (0x8613C)
#define ODCB		PIC32_R (0x86140) /* Port B: open drain configuration */
#define ODCBCLR		PIC32_R (0x86144)
#define ODCBSET		PIC32_R (0x86148)
#define ODCBINV		PIC32_R (0x8614C)

#ifndef PIC32_28PIN
#define ANSELC		PIC32_R (0x86200) /* Port C: analog select */
#define ANSELCCLR	PIC32_R (0x86204)
#define ANSELCSET	PIC32_R (0x86208)
#define ANSELCINV	PIC32_R (0x8620C)
#define TRISC		PIC32_R (0x86210) /* Port C: mask of inputs */
#define TRISCCLR	PIC32_R (0x86214)
#define TRISCSET	PIC32_R (0x86218)
#define TRISCINV	PIC32_R (0x8621C)
#define PORTC		PIC32_R (0x86220) /* Port C: read inputs, write outputs */
#define PORTCCLR	PIC32_R (0x86224)
#define PORTCSET	PIC32_R (0x86228)
#define PORTCINV	PIC32_R (0x8622C)
#define LATC		PIC32_R (0x86230) /* Port C: read/write outputs */
#define LATCCLR		PIC32_R (0x86234)
#define LATCSET		PIC32_R (0x86238)
#define LATCINV		PIC32_R (0x8623C)
#define ODCC		PIC32_R (0x86240) /* Port CB: open drain configuration */
#define ODCCCLR		PIC32_R (0x86244)
#define ODCCSET		PIC32_R (0x86248)
#define ODCCINV		PIC32_R (0x8624C)
#endif
#endif

/*--------------------------------------
 * A/D Converter registers.
 */
#define AD1CON1		PIC32_R (0x9000) /* Control register 1 */
#define AD1CON1CLR	PIC32_R (0x9004)
#define AD1CON1SET	PIC32_R (0x9008)
#define AD1CON1INV	PIC32_R (0x900C)
#define AD1CON2		PIC32_R (0x9010) /* Control register 2 */
#define AD1CON2CLR	PIC32_R (0x9014)
#define AD1CON2SET	PIC32_R (0x9018)
#define AD1CON2INV	PIC32_R (0x901C)
#define AD1CON3		PIC32_R (0x9020) /* Control register 3 */
#define AD1CON3CLR	PIC32_R (0x9024)
#define AD1CON3SET	PIC32_R (0x9028)
#define AD1CON3INV	PIC32_R (0x902C)
#define AD1CHS		PIC32_R (0x9040) /* Channel select */
#define AD1CHSCLR	PIC32_R (0x9044)
#define AD1CHSSET	PIC32_R (0x9048)
#define AD1CHSINV	PIC32_R (0x904C)
#define AD1CSSL		PIC32_R (0x9050) /* Input scan selection */
#define AD1CSSLCLR	PIC32_R (0x9054)
#define AD1CSSLSET	PIC32_R (0x9058)
#define AD1CSSLINV	PIC32_R (0x905C)

#if defined(PIC32MX3) || defined(PIC32MX4) || \
    defined(PIC32MX7)
#define AD1PCFG		PIC32_R (0x9060) /* Port configuration */
#define AD1PCFGCLR	PIC32_R (0x9064)
#define AD1PCFGSET	PIC32_R (0x9068)
#define AD1PCFGINV	PIC32_R (0x906C)
#endif
#define ADC1BUF0	PIC32_R (0x9070) /* Result words */
#define ADC1BUF1	PIC32_R (0x9080)
#define ADC1BUF2	PIC32_R (0x9090)
#define ADC1BUF3	PIC32_R (0x90A0)
#define ADC1BUF4	PIC32_R (0x90B0)
#define ADC1BUF5	PIC32_R (0x90C0)
#define ADC1BUF6	PIC32_R (0x90D0)
#define ADC1BUF7	PIC32_R (0x90E0)
#define ADC1BUF8	PIC32_R (0x90F0)
#define ADC1BUF9	PIC32_R (0x9100)
#define ADC1BUFA	PIC32_R (0x9110)
#define ADC1BUFB	PIC32_R (0x9120)
#define ADC1BUFC	PIC32_R (0x9130)
#define ADC1BUFD	PIC32_R (0x9140)
#define ADC1BUFE	PIC32_R (0x9150)
#define ADC1BUFF	PIC32_R (0x9160)

/*
 * ADC Control 1 register.
 */
#define PIC32_AD1CON1_DONE	0x0001      /* Conversion is done */
#define PIC32_AD1CON1_SAMP	0x0002      /* Sample enable */
#define PIC32_AD1CON1_ASAM	0x0004      /* Sample auto-start */
#define PIC32_AD1CON1_CLRASAM	0x0010      /* Stop conversion */
#define PIC32_AD1CON1_SSRC(n)	((n) << 5)  /* Conversion trigger source select */
#define PIC32_AD1CON1_FORM(n)	((n) << 8)  /* Data output format */
#define PIC32_AD1CON1_SIDL	0x2000      /* Stop in idle */
#define PIC32_AD1CON1_ON	0x8000      /* ADC is operating */

