institute-mpsu-miet/uos_embedded/runtime/mips/io-pic32mx.h
/*
 * SPI Control register.
 */
#define PIC32_SPICON_MSTEN	0x00000020	/* Master mode */
#define PIC32_SPICON_CKP	0x00000040      /* Idle clock is high level */
#define PIC32_SPICON_SSEN	0x00000080      /* Slave mode: SSx pin enable */
#define PIC32_SPICON_CKE	0x00000100      /* Output data changes on
						 * transition from active clock
						 * state to Idle clock state */
#define PIC32_SPICON_SMP	0x00000200      /* Master mode: input data sampled
						 * at end of data output time. */
#define PIC32_SPICON_MODE16	0x00000400      /* 16-bit data width */
#define PIC32_SPICON_MODE32	0x00000800      /* 32-bit data width */
#define PIC32_SPICON_DISSDO	0x00001000      /* SDOx pin is not used */
#define PIC32_SPICON_SIDL	0x00002000      /* Stop in Idle mode */
#define PIC32_SPICON_FRZ	0x00004000      /* Freeze in Debug mode */
#define PIC32_SPICON_ON		0x00008000      /* SPI Peripheral is enabled */
#define PIC32_SPICON_ENHBUF	0x00010000      /* Enhanced buffer enable */
#define PIC32_SPICON_SPIFE	0x00020000      /* Frame synchronization pulse
						 * coincides with the first bit clock */
#define PIC32_SPICON_FRMPOL	0x20000000      /* Frame pulse is active-high */
#define PIC32_SPICON_FRMSYNC	0x40000000      /* Frame sync pulse input (Slave mode) */
#define PIC32_SPICON_FRMEN	0x80000000      /* Framed SPI support */

/*
 * SPI Status register.
 */
#define PIC32_SPISTAT_SPIRBF	0x00000001      /* Receive buffer is full */
#define PIC32_SPISTAT_SPITBF	0x00000002      /* Transmit buffer is full */
#define PIC32_SPISTAT_SPITBE	0x00000008      /* Transmit buffer is empty */
#define PIC32_SPISTAT_SPIRBE    0x00000020      /* Receive buffer is empty */
#define PIC32_SPISTAT_SPIROV	0x00000040      /* Receive overflow flag */
#define PIC32_SPISTAT_SPIBUSY	0x00000800      /* SPI is busy */

/*--------------------------------------
 * DMA controller registers.
 */
#define DMACON          PIC32_R (0x83000)       /* DMA Control */
#define DMACONCLR	PIC32_R (0x83004)
#define DMACONSET	PIC32_R (0x83008)
#define DMACONINV	PIC32_R (0x8300C)
#define DMASTAT         PIC32_R (0x83010)       /* DMA Status */
#define DMAADDR         PIC32_R (0x83020)       /* DMA Address */
// TODO: other DMA registers.

/*--------------------------------------
 * System controller registers.
 */
#define OSCCON          PIC32_R (0xF000)
#define OSCTUN          PIC32_R (0xF010)
#if defined(PIC32MX1) || defined(PIC32MX2)
#define CFGCON          PIC32_R (0xF200)        /* Configuration Control */
#else
#define DDPCON          PIC32_R (0xF200)        /* Debug Data Port Control */
#define DDPCON          PIC32_R (0xF200)        /* Debug Data Port Control */
#define DDPCONCLR	PIC32_R (0xF204)
#define DDPCONSET	PIC32_R (0xF208)
#define DDPCONINV	PIC32_R (0xF20C)
#endif
#define DEVID           PIC32_R (0xF220)
#define SYSKEY          PIC32_R (0xF230)
#define RCON            PIC32_R (0xF600)
#define RCONCLR         PIC32_R (0xF604)
#define RCONSET         PIC32_R (0xF608)
#define RCONINV         PIC32_R (0xF60C)
#define RSWRST          PIC32_R (0xF610)
#define RSWRSTCLR       PIC32_R (0xF614)
#define RSWRSTSET       PIC32_R (0xF618)
#define RSWRSTINV       PIC32_R (0xF61C)

/*
 * Reset control register.
 */
#define PIC32_RCON_POR          0x00000001
#define PIC32_RCON_BOR          0x00000002
#define PIC32_RCON_IDLE         0x00000004
#define PIC32_RCON_SLEEP        0x00000008
#define PIC32_RCON_WDTO         0x00000010
#define PIC32_RCON_SWR          0x00000040
#define PIC32_RCON_EXTR         0x00000080
#define PIC32_RCON_VREGS        0x00000100
#define PIC32_RCON_CMR          0x00000200

/*--------------------------------------
 * Prefetch cache controller registers.
 */
#if defined(PIC32MX3) || defined(PIC32MX4) || \
    defined(PIC32MX7)
#define CHECON          PIC32_R (0x84000)       /* Prefetch cache control */
#define CHECONCLR	PIC32_R (0x84004)
#define CHECONSET	PIC32_R (0x84008)
#define CHECONINV	PIC32_R (0x8400C)
// TODO: other prefetech registers
#endif

/*--------------------------------------
 * Bus matrix control registers.
 */
#define BMXCON          PIC32_R (0x82000)       /* Memory configuration */
#define BMXCONCLR	PIC32_R (0x82004)
#define BMXCONSET	PIC32_R (0x82008)
#define BMXCONINV	PIC32_R (0x8200C)
#define BMXDKPBA        PIC32_R (0x82010)       /* Data RAM kernel program base address */
#define BMXDKPBACLR	PIC32_R (0x82014)
#define BMXDKPBASET	PIC32_R (0x82018)
#define BMXDKPBAINV	PIC32_R (0x8201C)
#define BMXDUDBA        PIC32_R (0x82020)       /* Data RAM user data base address */
#define BMXDUDBACLR	PIC32_R (0x82024)
#define BMXDUDBASET	PIC32_R (0x82028)
#define BMXDUDBAINV	PIC32_R (0x8202C)
#define BMXDUPBA        PIC32_R (0x82030)       /* Data RAM user program base address */
#define BMXDUPBACLR	PIC32_R (0x82034)
#define BMXDUPBASET	PIC32_R (0x82038)
#define BMXDUPBAINV	PIC32_R (0x8203C)
#define BMXDRMSZ        PIC32_R (0x82040)       /* Data RAM size */
#define BMXPUPBA        PIC32_R (0x82050)       /* Program Flash user program base address */
#define BMXPUPBACLR	PIC32_R (0x82054)
#define BMXPUPBASET	PIC32_R (0x82058)
#define BMXPUPBAINV	PIC32_R (0x8205C)
#define BMXPFMSZ        PIC32_R (0x82060)       /* Program Flash size */
#define BMXBOOTSZ       PIC32_R (0x82070)       /* Boot Flash size */

/*--------------------------------------
 * Real time clock and calendar.
 */
#define RTCCON          PIC32_R (0x0200)  /* RTC control */
#define RTCALRM         PIC32_R (0x0210)  /* RTC alarm control */
#define RTCTIME         PIC32_R (0x0220)  /* RTC time value */
#define RTCDATE         PIC32_R (0x0230)  /* RTC date value */
#define ALRMTIME        PIC32_R (0x0240)  /* Alarm time value */
#define ALRMDATE        PIC32_R (0x0250)  /* Alarm date value */

/*--------------------------------------
 * Timer registers.
 */
#define T1CON           PIC32_R (0x0600)  /* Timer 1 control */
#define TMR1            PIC32_R (0x0610)  /* Timer 1 count */
#define PR1             PIC32_R (0x0620)  /* Timer 1 period */
#define T2CON           PIC32_R (0x0800)  /* Timer 2 control */
#define TMR2            PIC32_R (0x0810)  /* Timer 2 count */
#define PR2             PIC32_R (0x0820)  /* Timer 2 period */
#define T3CON           PIC32_R (0x0A00)  /* Timer 3 control */
#define TMR3            PIC32_R (0x0A10)  /* Timer 3 count */
#define PR3             PIC32_R (0x0A20)  /* Timer 3 period */
#define T4CON           PIC32_R (0x0C00)  /* Timer 4 control */
#define TMR4            PIC32_R (0x0C10)  /* Timer 4 count */
#define PR4             PIC32_R (0x0C20)  /* Timer 4 period */
#define T5CON           PIC32_R (0x0E00)  /* Timer 5 control */
#define TMR5            PIC32_R (0x0E10)  /* Timer 5 count */
#define PR5             PIC32_R (0x0E20)  /* Timer 5 period */

