institute-mpsu-miet/uos_embedded/runtime/mips/io-pic32mx.h
/*
 * Timer Control register.
 */
#define PIC32_TCON_ON           0x8000  /* Timer is enabled */
#define PIC32_TCON_FRZ          0x4000  /* Freeze when CPU is in Debug mode */
#define PIC32_TCON_SIDL         0x2000  /* Stop in Idle mode */
#define PIC32_TCON_TWDIS        0x1000  /* (Timer A) Asynchronous Timer Write Disable */
#define PIC32_TCON_TWIP         0x0800  /* (Timer A) Asynchronous Timer Write in Progress */
#define PIC32_TCON_TGATE        0x0080  /* Enable gated time accumulation (only when TCS=0) */
#define PIC32_TCON_TCKPS_MASK   0x0070  /* Timer Input Clock Prescale Select */
#define PIC32_TCON_TCKPS_256    0x0070  /* 1:256 */
#define PIC32_TCON_TCKPS_64     0x0060  /* 1:64 */
#define PIC32_TCON_TCKPS_32     0x0050  /* 1:32 */
#define PIC32_TCON_TCKPS_16     0x0040  /* 1:16 */
#define PIC32_TCON_TCKPS_8      0x0030  /* 1:8 */
#define PIC32_TCON_TCKPS_4      0x0020  /* 1:4 */
#define PIC32_TCON_TCKPS_2      0x0010  /* 1:2 */
#define PIC32_TCON_TCKPS_1      0x0000  /* 1:1 */
#define PIC32_TCON_T32          0x0008  /* (Timer B) TMRx and TMRy form a 32-bit timer */
#define PIC32_TCON_TSYNC        0x0004  /* (Timer A) External clock input is synchronized */
#define PIC32_TCON_TCS          0x0002  /* External clock from TxCKI pin */

/*--------------------------------------
 * Non-volatile memory control registers.
 */
#define NVMCON          PIC32_R (0xF400)
#define NVMCONCLR       PIC32_R (0xF404)
#define NVMCONSET       PIC32_R (0xF408)
#define NVMCONINV       PIC32_R (0xF40C)
#define NVMKEY          PIC32_R (0xF410)
#define NVMADDR         PIC32_R (0xF420)
#define NVMADDRCLR      PIC32_R (0xF424)
#define NVMADDRSET      PIC32_R (0xF428)
#define NVMADDRINV      PIC32_R (0xF42C)
#define NVMDATA         PIC32_R (0xF430)
#define NVMSRCADDR      PIC32_R (0xF440)

#define PIC32_NVMCON_NVMOP      0x0000000F
#define PIC32_NVMCON_NOP                 0 /* No operation */
#define PIC32_NVMCON_WORD_PGM            1 /* Word program */
#define PIC32_NVMCON_ROW_PGM             3 /* Row program */
#define PIC32_NVMCON_PAGE_ERASE          4 /* Page erase */

#define PIC32_NVMCON_LVDSTAT    0x00000800
#define PIC32_NVMCON_LVDERR     0x00001000
#define PIC32_NVMCON_WRERR      0x00002000
#define PIC32_NVMCON_WREN       0x00004000
#define PIC32_NVMCON_WR         0x00008000

/*--------------------------------------
 * Peripheral port select registers.
 */
#define INT1R           PIC32_R (0xFA04)
#define INT2R           PIC32_R (0xFA08)
#define INT3R           PIC32_R (0xFA0C)
#define INT4R           PIC32_R (0xFA10)
#define T2CKR           PIC32_R (0xFA18)
#define T3CKR           PIC32_R (0xFA1C)
#define T4CKR           PIC32_R (0xFA20)
#define T5CKR           PIC32_R (0xFA24)
#define IC1R            PIC32_R (0xFA28)
#define IC2R            PIC32_R (0xFA2C)
#define IC3R            PIC32_R (0xFA30)
#define IC4R            PIC32_R (0xFA34)
#define IC5R            PIC32_R (0xFA38)
#define OCFAR           PIC32_R (0xFA48)
#define OCFBR           PIC32_R (0xFA4C)
#define U1RXR           PIC32_R (0xFA50)
#define U1CTSR          PIC32_R (0xFA54)
#define U2RXR           PIC32_R (0xFA58)
#define U2CTSR          PIC32_R (0xFA5C)
#define SDI1R           PIC32_R (0xFA84)
#define SS1R            PIC32_R (0xFA88)
#define SDI2R           PIC32_R (0xFA90)
#define SS2R            PIC32_R (0xFA94)
#define REFCLKIR        PIC32_R (0xFAB8)

#define RPA0R           PIC32_R (0xFB00)
#define RPA1R           PIC32_R (0xFB04)
#define RPA2R           PIC32_R (0xFB08)
#define RPA3R           PIC32_R (0xFB0C)
#define RPA4R           PIC32_R (0xFB10)
#define RPA8R           PIC32_R (0xFB20)
#define RPA9R           PIC32_R (0xFB24)
#define RPB0R           PIC32_R (0xFB2C)
#define RPB1R           PIC32_R (0xFB30)
#define RPB2R           PIC32_R (0xFB34)
#define RPB3R           PIC32_R (0xFB38)
#define RPB4R           PIC32_R (0xFB3C)
#define RPB5R           PIC32_R (0xFB40)
#define RPB6R           PIC32_R (0xFB44)
#define RPB7R           PIC32_R (0xFB48)
#define RPB8R           PIC32_R (0xFB4C)
#define RPB9R           PIC32_R (0xFB50)
#define RPB10R          PIC32_R (0xFB54)
#define RPB11R          PIC32_R (0xFB58)
#define RPB12R          PIC32_R (0xFB5C)
#define RPB13R          PIC32_R (0xFB60)
#define RPB14R          PIC32_R (0xFB64)
#define RPB15R          PIC32_R (0xFB68)
#define RPC0R           PIC32_R (0xFB6C)
#define RPC1R           PIC32_R (0xFB70)
#define RPC2R           PIC32_R (0xFB74)
#define RPC3R           PIC32_R (0xFB78)
#define RPC4R           PIC32_R (0xFB7C)
#define RPC5R           PIC32_R (0xFB80)
#define RPC6R           PIC32_R (0xFB84)
#define RPC7R           PIC32_R (0xFB88)
#define RPC8R           PIC32_R (0xFB8C)
#define RPC9R           PIC32_R (0xFB90)

/*--------------------------------------
 * Configuration registers.
 */
#define PIC32_DEVCFG(cfg0, cfg1, cfg2, cfg3) \
    asm (".section .config"); \
    unsigned __DEVCFG0 __attribute__ ((section (".config0"))) = (cfg0) ^ 0x7fffffff; \
    unsigned __DEVCFG1 __attribute__ ((section (".config1"))) = (cfg1) | DEVCFG1_UNUSED; \
    unsigned __DEVCFG2 __attribute__ ((section (".config2"))) = (cfg2) | DEVCFG2_UNUSED; \
    unsigned __DEVCFG3 __attribute__ ((section (".config3"))) = (cfg3) | DEVCFG3_UNUSED

#ifndef __ASSEMBLER__
extern unsigned __devcfg__[];           /* Declared in linker script */
#define DEVCFG0 __devcfg__[3]
#define DEVCFG1 __devcfg__[2]
#define DEVCFG2 __devcfg__[1]
#define DEVCFG3 __devcfg__[0]
#endif


/*
 * Config0 register at 1fc02ffc, inverted.
 */
#define DEVCFG0_DEBUG_MASK      0x00000003 /* Debugger enable bits */
#define DEVCFG0_DEBUG_DISABLED  0x00000000 /* Debugger disabled */
#define DEVCFG0_DEBUG_ENABLED   0x00000002 /* Debugger enabled */
#define DEVCFG0_JTAGDIS         0x00000004 /* Disable JTAG port */
#define DEVCFG0_ICESEL_PAIR1    0x00000000 /* Use PGC1/PGD1 */
#define DEVCFG0_ICESEL_PAIR2    0x00000008 /* Use PGC2/PGD2 */
#define DEVCFG0_ICESEL_PAIR3    0x00000010 /* Use PGC3/PGD3 */
#define DEVCFG0_ICESEL_PAIR4    0x00000018 /* Use PGC4/PGD4 */
#define DEVCFG0_PWP_MASK        0x000ff000 /* Program flash write protect */
#define DEVCFG0_BWP             0x01000000 /* Boot flash write protect */
#define DEVCFG0_CP              0x10000000 /* Code protect */

